/*
 * На основании примера HelloDate.java в этой главе напришите программу "Привет, Мир", которая просто выводит
 * это сообщение. Программа будет стодержать только один метод(тот, который испоняется при запуске программы - main()),
 * Не забудьте объявить его сатическим (static) и включите список аргументов, даже если вы не будете его использовать.
 * Скомпилируйте программу с помощью javac и запстите на исполнение java.
 */

class Task2 {
	public static void main(String[]args){
		System.out.println("Hello World");
		}
	}